# PaperSources Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..PaperSources Property
PrintManager Class See Also
---
Get all print sources of current printer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PaperSourceSet PaperSources { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PaperSources As PaperSourceSet
	Get
```

Visual C++
---
```text
public:
property PaperSourceSet^ PaperSources {
	PaperSourceSet^ get ();
}
```

# Remarks
These are the valid paper source for the current printer.
# See Also
PrintManager Class
Autodesk.Revit.DB Namespace